<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" type="text/css" href="lyric.css">
    <title>Document</title>
</head>

<body>
    <h1 class="pagetitle">
        <span class="highlight">108 Names of Lord Ganesha | Ashtottara Shatanamavali of Lord Ganesha</span>
    </h1>

    <div class="separatorline"></div>

    <div class="video" style="height:250px; margin-bottom: 100px;">
        <iframe class="dpvideo" id="dpYoutubVideoI" src="https://www.youtube.com/embed/ty_BRH3b9lY?enablejsapi=1&rel=0&fs=0&origin"></iframe>
        <div class="videoclose"></div>
    </div>

    <div class="oltag">
        <ol>
            <li>
                <p>ॐ गजाननाय नमः।</p>
            </li>
            <li>
                <p>ॐ गणाध्यक्षाय नमः।</p>
            </li>
            <li>
                <p>ॐ विघ्नराजाय नमः।</p>
            </li>
            <li>
                <p>ॐ विनायकाय नमः।</p>
            </li>
            <li>
                <p>ॐ द्वैमातुराय नमः।</p>
            </li>
            <li>
                <p>ॐ द्विमुखाय नमः।</p>
            </li>
            <li>
                <p>ॐ प्रमुखाय नमः।</p>
            </li>
            <li>
                <p>ॐ सुमुखाय नमः।</p>
            </li>
            <li>
                <p>ॐ कृतिने नमः।</p>
            </li>
            <li>
                <p>ॐ सुप्रदीपाय नमः।</p>
            </li>
            <li>
                <p>ॐ सुखनिधये नमः।</p>
            </li>
            <li>
                <p>ॐ सुराध्यक्षाय नमः।</p>
            </li>
            <li>
                <p>ॐ सुरारिघ्नाय नमः।</p>
            </li>
            <li>
                <p>ॐ महागणपतये नमः।</p>
            </li>
            <li>
                <p>ॐ मान्याय नमः।</p>
            </li>
            <li>
                <p>ॐ महाकालाय नमः।</p>
            </li>
            <li>
                <p>ॐ महाबलाय नमः।</p>
            </li>
            <li>
                <p>ॐ हेरम्बाय नमः।</p>
            </li>
            <li>
                <p>ॐ लम्बजठराय नमः।</p>
            </li>
            <li>
                <p>ॐ ह्रस्वग्रीवाय नमः।</p>
            </li>
            <li>
                <p>ॐ महोदराय नमः।</p>
            </li>
            <li>
                <p>ॐ मदोत्कटाय नमः।</p>
            </li>
            <li>
                <p>ॐ महावीराय नमः।</p>
            </li>
            <li>
                <p>ॐ मन्त्रिणे नमः।</p>
            </li>
            <li>
                <p>ॐ मङ्गलस्वराय नमः।</p>
            </li>
            <li>
                <p>ॐ प्रमधाय नमः।</p>
            </li>
            <li>
                <p>ॐ प्रथमाय नमः।</p>
            </li>
            <li>
                <p>ॐ प्राज्ञाय नमः।</p>
            </li>
            <li>
                <p>ॐ विघ्नकर्त्रे नमः।</p>
            </li>
            <li>
                <p>ॐ विघ्नहर्त्रे नमः।</p>
            </li>
            <li>
                <p>ॐ विश्वनेत्रे नमः।</p>
            </li>
            <li>
                <p>ॐ विराट्पतये नमः।</p>
            </li>
            <li>
                <p>ॐ श्रीपतये नमः।</p>
            </li>
            <li>
                <p>ॐ वाक्पतये नमः।</p>
            </li>
            <li>
                <p>ॐ शृङ्गारिणे नमः।</p>
            </li>
            <li>
                <p>ॐ अश्रितवत्सलाय नमः।</p>
            </li>
            <li>
                <p>ॐ शिवप्रियाय नमः।</p>
            </li>
            <li>
                <p>ॐ शीघ्रकारिणे नमः।</p>
            </li>
            <li>
                <p>ॐ शाश्वताय नमः।</p>
            </li>
            <li>
                <p>ॐ बलाय नमः।</p>
            </li>
            <li>
                <p>ॐ बलोत्थिताय नमः।</p>
            </li>
            <li>
                <p>ॐ भवात्मजाय नमः।</p>
            </li>
            <li>
                <p>ॐ पुराणपुरुषाय नमः।</p>
            </li>
            <li>
                <p>ॐ पूष्णे नमः।</p>
            </li>
            <li>
                <p>ॐ पुष्करोत्षिप्तवारिणे नमः।</p>
            </li>
            <li>
                <p>ॐ अग्रगण्याय नमः।</p>
            </li>
            <li>
                <p>ॐ अग्रपूज्याय नमः।</p>
            </li>
            <li>
                <p>ॐ अग्रगामिने नमः।</p>
            </li>
            <li>
                <p>ॐ मन्त्रकृते नमः।</p>
            </li>
            <li>
                <p>ॐ चामीकरप्रभाय नमः।</p>
            </li>
            <li>
                <p>ॐ सर्वाय नमः।</p>
            </li>
            <li>
                <p>ॐ सर्वोपास्याय नमः।</p>
            </li>
            <li>
                <p>ॐ सर्वकर्त्रे नमः।</p>
            </li>
            <li>
                <p>ॐ सर्वनेत्रे नमः।</p>
            </li>
            <li>
                <p>ॐ सर्वसिद्धिप्रदाय नमः।</p>
            </li>
            <li>
                <p>ॐ सिद्धये नमः।</p>
            </li>
            <li>
                <p>ॐ पञ्चहस्ताय नमः।</p>
            </li>
            <li>
                <p>ॐ पार्वतीनन्दनाय नमः।</p>
            </li>
            <li>
                <p>ॐ प्रभवे नमः।</p>
            </li>
            <li>
                <p>ॐ कुमारगुरवे नमः।</p>
            </li>
            <li>
                <p>ॐ अक्षोभ्याय नमः।</p>
            </li>
            <li>
                <p>ॐ कुञ्जरासुरभञ्जनाय नमः।</p>
            </li>
            <li>
                <p>ॐ प्रमोदाय नमः।</p>
            </li>
            <li>
                <p>ॐ मोदकप्रियाय नमः।</p>
            </li>
            <li>
                <p>ॐ कान्तिमते नमः।</p>
            </li>
            <li>
                <p>ॐ धृतिमते नमः।</p>
            </li>
            <li>
                <p>ॐ कामिने नमः।</p>
            </li>
            <li>
                <p>ॐ कपित्थपनसप्रियाय नमः।</p>
            </li>
            <li>
                <p>ॐ ब्रह्मचारिणे नमः।</p>
            </li>
            <li>
                <p>ॐ ब्रह्मरूपिणे नमः।</p>
            </li>
            <li>
                <p>ॐ ब्रह्मविद्यादिदानभुवे नमः।</p>
            </li>
            <li>
                <p>ॐ जिष्णवे नमः।</p>
            </li>
            <li>
                <p>ॐ विष्णुप्रियाय नमः।</p>
            </li>
            <li>
                <p>ॐ भक्तजीविताय नमः।</p>
            </li>
            <li>
                <p>ॐ जितमन्मथाय नमः।</p>
            </li>
            <li>
                <p>ॐ ऐश्वर्यकारणाय नमः।</p>
            </li>
            <li>
                <p>ॐ ज्यायसे नमः।</p>
            </li>
            <li>
                <p>ॐ यक्षकिन्नरसेविताय नमः।</p>
            </li>
            <li>
                <p>ॐ गङ्गासुताय नमः।</p>
            </li>
            <li>
                <p>ॐ गणाधीशाय नमः।</p>
            </li>
            <li>
                <p>ॐ गम्भीरनिनदाय नमः।</p>
            </li>
            <li>
                <p>ॐ वटवे नमः।</p>
            </li>
            <li>
                <p>ॐ अभीष्टवरदाय नमः।</p>
            </li>
            <li>
                <p>ॐ ज्योतिषे नमः।</p>
            </li>
            <li>
                <p>ॐ भक्तनिधये नमः।</p>
            </li>
            <li>
                <p>ॐ भावगम्याय नमः।</p>
            </li>
            <li>
                <p>ॐ मङ्गलप्रदाय नमः।</p>
            </li>
            <li>
                <p>ॐ अव्यक्ताय नमः।</p>
            </li>
            <li>
                <p>ॐ अप्राकृतपराक्रमाय नमः।</p>
            </li>
            <li>
                <p>ॐ सत्यधर्मिणे नमः।</p>
            </li>
            <li>
                <p>ॐ सखये नमः।</p>
            </li>
            <li>
                <p>ॐ सरसाम्बुनिधये नमः।</p>
            </li>
            <li>
                <p>ॐ महेशाय नमः।</p>
            </li>
            <li>
                <p>ॐ दिव्याङ्गाय नमः।</p>
            </li>
            <li>
                <p>ॐ मणिकिङ्किणीमेखलाय नमः।</p>
            </li>
            <li>
                <p>ॐ समस्तदेवतामूर्तये नमः</p>
            </li>
            <li>
                <p>ॐ सहिष्णवे नमः।</p>
            </li>
            <li>
                <p>ॐ सततोत्थिताय नमः।</p>
            </li>
            <li>
                <p>ॐ विघातकारिणे नमः।</p>
            </li>
            <li>
                <p>ॐ विश्वग्दृशे नमः।</p>
            </li>
            <li>
                <p>ॐ विश्वरक्षाकृते नमः।</p>
            </li>
            <li>
                <p>ॐ कल्याणगुरवे नमः।</p>
            </li>
            <li>
                <p>ॐ उन्मत्तवेषाय नमः।</p>
            </li>
            <li>
                <p>ॐ अपराजिते नमः।</p>
            </li>
            <li>
                <p>ॐ समस्तजगदाधाराय नमः।</p>
            </li>
            <li>
                <p>ॐ सर्वैश्वर्यप्रदाय नमः।</p>
            </li>
            <li>
                <p>ॐ आक्रान्तचिदचित्प्रभवे नमः।</p>
            </li>
            <li>
                <p>ॐ श्री विघ्नेश्वराय नमः।</p>
            </li>
        </ol>
    </div>
    <h2 class="mtitle" style="margin-bottom: 25px;">॥ Iti Shri Ganesha Ashtottarashatanamavalih Sampurna ॥</h2>

</body>

</html>