<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" type="text/css" href="lyric.css">
    <title>Document</title>
</head>

<body>
    <h1 class="pagetitle">
        <span class="highlight">108 Names of Lord Shiva | Ashtottara Shatanamavali of Lord Shiva</span>
    </h1>

    <div class="separatorline"></div>

    <div class="video" style="height:250px; margin-bottom: 100px;">
        <iframe class="dpvideo" id="dpYoutubVideoI" src="https://www.youtube.com/embed/u7_k_wa3a18?enablejsapi=1&rel=0&fs=0&origin"></iframe>
        <div class="videoclose"></div>
    </div>

    <div class="oltag">
        <ol>
            <li>
                <p>ॐ शिवाय नमः।</p>
            </li>
            <li>
                <p>ॐ महेश्वराय नमः।</p>
            </li>
            <li>
                <p>ॐ शम्भवे नमः।</p>
            </li>
            <li>
                <p>ॐ पिनाकिने नमः।</p>
            </li>
            <li>
                <p>ॐ शशिशेखराय नमः।</p>
            </li>
            <li>
                <p>ॐ वामदेवाय नमः।</p>
            </li>
            <li>
                <p>ॐ विरूपाक्षाय नमः।</p>
            </li>
            <li>
                <p>ॐ कपर्दिने नमः।</p>
            </li>
            <li>
                <p>ॐ नीललोहिताय नमः।</p>
            </li>
            <li>
                <p>ॐ शङ्कराय नमः।</p>
            </li>
            <li>
                <p>ॐ शूलपाणिने नमः।</p>
            </li>
            <li>
                <p>ॐ खट्वाङ्गिने नमः।</p>
            </li>
            <li>
                <p>ॐ विष्णुवल्लभाय नमः।</p>
            </li>
            <li>
                <p>ॐ शिपिविष्टाय नमः।</p>
            </li>
            <li>
                <p>ॐ अम्बिकानाथाय नमः।</p>
            </li>
            <li>
                <p>ॐ श्रीकण्ठाय नमः।</p>
            </li>
            <li>
                <p>ॐ भक्तवत्सलाय नमः।</p>
            </li>
            <li>
                <p>ॐ भवाय नमः।</p>
            </li>
            <li>
                <p>ॐ शर्वाय नमः।</p>
            </li>
            <li>
                <p>ॐ त्रिलोकेशाय नमः।</p>
            </li>
            <li>
                <p>ॐ शितिकण्ठाय नमः।</p>
            </li>
            <li>
                <p>ॐ शिवाप्रियाय नमः।</p>
            </li>
            <li>
                <p>ॐ उग्राय नमः।</p>
            </li>
            <li>
                <p>ॐ कपालिने नमः।</p>
            </li>
            <li>
                <p>ॐ कामारये नमः।</p>
            </li>
            <li>
                <p>ॐ अन्धकासुरसूदनाय नमः।</p>
            </li>
            <li>
                <p>ॐ गङ्गाधराय नमः।</p>
            </li>
            <li>
                <p>ॐ ललाटाक्षाय नमः।</p>
            </li>
            <li>
                <p>ॐ कालकालाय नमः।</p>
            </li>
            <li>
                <p>ॐ कृपानिधये नमः।</p>
            </li>
            <li>
                <p>ॐ भीमाय नमः।</p>
            </li>
            <li>
                <p>ॐ परशुहस्ताय नमः।</p>
            </li>
            <li>
                <p>ॐ मृगपाणये नमः।</p>
            </li>
            <li>
                <p>ॐ जटाधराय नमः।</p>
            </li>
            <li>
                <p>ॐ कैलासवासिने नमः।</p>
            </li>
            <li>
                <p>ॐ कवचिने नमः।</p>
            </li>
            <li>
                <p>ॐ कठोराय नमः।</p>
            </li>
            <li>
                <p>ॐ त्रिपुरान्तकाय नमः।</p>
            </li>
            <li>
                <p>ॐ वृषाङ्काय नमः।</p>
            </li>
            <li>
                <p>ॐ वृषभारूढाय नमः।</p>
            </li>
            <li>
                <p>ॐ भस्मोद्धूलितविग्रहाय नमः।</p>
            </li>
            <li>
                <p>ॐ सामप्रियाय नमः।</p>
            </li>
            <li>
                <p>ॐ स्वरमयाय नमः।</p>
            </li>
            <li>
                <p>ॐ त्रयीमूर्तये नमः।</p>
            </li>
            <li>
                <p>ॐ अनीश्वराय नमः।</p>
            </li>
            <li>
                <p>ॐ सर्वज्ञाय नमः।</p>
            </li>
            <li>
                <p>ॐ परमात्मने नमः।</p>
            </li>
            <li>
                <p>ॐ सोमसूर्याग्निलोचनाय नमः।</p>
            </li>
            <li>
                <p>ॐ हविषे नमः।</p>
            </li>
            <li>
                <p>ॐ यज्ञमयाय नमः।</p>
            </li>
            <li>
                <p>ॐ सोमाय नमः।</p>
            </li>
            <li>
                <p>ॐ पञ्चवक्त्राय नमः।</p>
            </li>
            <li>
                <p>ॐ सदाशिवाय नमः।</p>
            </li>
            <li>
                <p>ॐ विश्वेश्वराय नमः।</p>
            </li>
            <li>
                <p>ॐ वीरभद्राय नमः।</p>
            </li>
            <li>
                <p>ॐ गणनाथाय नमः।</p>
            </li>
            <li>
                <p>ॐ प्रजापतये नमः।</p>
            </li>
            <li>
                <p>ॐ हिरण्यरेतसे नमः।</p>
            </li>
            <li>
                <p>ॐ दुर्धर्षाय नमः।</p>
            </li>
            <li>
                <p>ॐ गिरीशाय नमः।</p>
            </li>
            <li>
                <p>ॐ गिरिशाय नमः।</p>
            </li>
            <li>
                <p>ॐ अनघाय नमः।</p>
            </li>
            <li>
                <p>ॐ भुजङ्गभूषणाय नमः।</p>
            </li>
            <li>
                <p>ॐ भर्गाय नमः।</p>
            </li>
            <li>
                <p>ॐ गिरिधन्विने नमः।</p>
            </li>
            <li>
                <p>ॐ गिरिप्रियाय नमः।</p>
            </li>
            <li>
                <p>ॐ कृत्तिवाससे नमः।</p>
            </li>
            <li>
                <p>ॐ पुरारातये नमः।</p>
            </li>
            <li>
                <p>ॐ भगवते नमः।</p>
            </li>
            <li>
                <p>ॐ प्रमथाधिपाय नमः।</p>
            </li>
            <li>
                <p>ॐ मृत्युञ्जयाय नमः।</p>
            </li>
            <li>
                <p>ॐ सूक्ष्मतनवे नमः।</p>
            </li>
            <li>
                <p>ॐ जगद्व्यापिने नमः।</p>
            </li>
            <li>
                <p>ॐ जगद्गुरवे नमः।</p>
            </li>
            <li>
                <p>ॐ व्योमकेशाय नमः।</p>
            </li>
            <li>
                <p>ॐ महासेनजनकाय नमः।</p>
            </li>
            <li>
                <p>ॐ चारुविक्रमाय नमः।</p>
            </li>
            <li>
                <p>ॐ रुद्राय नमः।</p>
            </li>
            <li>
                <p>ॐ भूतपतये नमः।</p>
            </li>
            <li>
                <p>ॐ स्थाणवे नमः।</p>
            </li>
            <li>
                <p>ॐ अहिर्बुध्न्याय नमः।</p>
            </li>
            <li>
                <p>ॐ दिगम्बराय नमः।</p>
            </li>
            <li>
                <p>ॐ अष्टमूर्तये नमः।</p>
            </li>
            <li>
                <p>ॐ अनेकात्मने नमः।</p>
            </li>
            <li>
                <p>ॐ सात्त्विकाय नमः।</p>
            </li>
            <li>
                <p>ॐ शुद्धविग्रहाय नमः।</p>
            </li>
            <li>
                <p>ॐ शाश्वताय नमः।</p>
            </li>
            <li>
                <p>ॐ खण्डपरशवे नमः।</p>
            </li>
            <li>
                <p>ॐ अजाय नमः।</p>
            </li>
            <li>
                <p>ॐ पाशविमोचकाय नमः।</p>
            </li>
            <li>
                <p>ॐ मृडाय नमः।</p>
            </li>
            <li>
                <p>ॐ पशुपतये नमः।</p>
            </li>
            <li>
                <p>ॐ देवाय नमः।</p>
            </li>
            <li>
                <p>ॐ महादेवाय नमः।</p>
            </li>
            <li>
                <p>ॐ अव्ययाय नमः।</p>
            </li>
            <li>
                <p>ॐ हरये नमः।</p>
            </li>
            <li>
                <p>ॐ पूषदन्तभिदे नमः।</p>
            </li>
            <li>
                <p>ॐ अव्यग्राय नमः।</p>
            </li>
            <li>
                <p>ॐ दक्षाध्वरहराय नमः।</p>
            </li>
            <li>
                <p>ॐ हराय नमः।</p>
            </li>
            <li>
                <p>ॐ भगनेत्रभिदे नमः।</p>
            </li>
            <li>
                <p>ॐ अव्यक्ताय नमः।</p>
            </li>
            <li>
                <p>ॐ सहस्राक्षाय नमः।</p>
            </li>
            <li>
                <p>ॐ सहस्रपदे नमः।</p>
            </li>
            <li>
                <p>ॐ अपवर्गप्रदाय नमः।</p>
            </li>
            <li>
                <p>ॐ अनन्ताय नमः।</p>
            </li>
            <li>
                <p>ॐ तारकाय नमः।</p>
            </li>
            <li>
                <p>ॐ परमेश्वराय नमः।</p>
            </li>
        </ol>
    </div>
    <h2 class="mtitle" style="margin-bottom: 25px;">॥ Iti Shri Shiva Ashtottarashatanamavalih Sampurna ॥</h2>
</body>

</html>