<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" type="text/css" href="lyric.css">
    <title>Document</title>
</head>

<body>
    <h1 class="pagetitle">
        <span class="highlight">108 Names of Lord Vishnu | Ashtottara Shatanamavali of Lord Vishnu</span>
    </h1>

    <div class="separatorline"></div>

    <div class="video" style="height:250px; margin-bottom: 100px;">
        <iframe class="dpvideo" id="dpYoutubVideoI" src="https://www.youtube.com/embed/Xky0xLvINcc?enablejsapi=1&rel=0&fs=0&origin"></iframe>
        <div class="videoclose"></div>
    </div>

    <div class="oltag">
        <ol>
            <li>
                <p>ॐ विष्णवे नमः।</p>
            </li>
            <li>
                <p>ॐ लक्ष्मीपतये नमः।</p>
            </li>
            <li>
                <p>ॐ कृष्णाय नमः।</p>
            </li>
            <li>
                <p>ॐ वैकुण्ठाय नमः।</p>
            </li>
            <li>
                <p>ॐ गरुडध्वजाय नमः।</p>
            </li>
            <li>
                <p>ॐ परब्रह्मणे नमः।</p>
            </li>
            <li>
                <p>ॐ जगन्नाथाय नमः।</p>
            </li>
            <li>
                <p>ॐ वासुदेवाय नमः।</p>
            </li>
            <li>
                <p>ॐ त्रिविक्रमाय नमः।</p>
            </li>
            <li>
                <p>ॐ दैत्यान्तकाय नमः।</p>
            </li>
            <li>
                <p>ॐ मधुरिपवे नमः।</p>
            </li>
            <li>
                <p>ॐ तार्क्ष्यवाहनाय नमः।</p>
            </li>
            <li>
                <p>ॐ सनातनाय नमः।</p>
            </li>
            <li>
                <p>ॐ नारायणाय नमः।</p>
            </li>
            <li>
                <p>ॐ पद्मनाभाय नमः।</p>
            </li>
            <li>
                <p>ॐ हृषीकेशाय नमः।</p>
            </li>
            <li>
                <p>ॐ सुधाप्रदाय नमः।</p>
            </li>
            <li>
                <p>ॐ माधवाय नमः।</p>
            </li>
            <li>
                <p>ॐ पुण्डरीकाक्षाय नमः।</p>
            </li>
            <li>
                <p>ॐ स्थितिकर्त्रे नमः।</p>
            </li>
            <li>
                <p>ॐ परात्पराय नमः।</p>
            </li>
            <li>
                <p>ॐ वनमालिने नमः।</p>
            </li>
            <li>
                <p>ॐ यज्ञरूपाय नमः।</p>
            </li>
            <li>
                <p>ॐ चक्रपाणये नमः।</p>
            </li>
            <li>
                <p>ॐ गदाधराय नमः।</p>
            </li>
            <li>
                <p>ॐ उपेन्द्राय नमः।</p>
            </li>
            <li>
                <p>ॐ केशवाय नमः।</p>
            </li>
            <li>
                <p>ॐ हंसाय नमः।</p>
            </li>
            <li>
                <p>ॐ समुद्रमथनाय नमः।</p>
            </li>
            <li>
                <p>ॐ हरये नमः।</p>
            </li>
            <li>
                <p>ॐ गोविन्दाय नमः।</p>
            </li>
            <li>
                <p>ॐ ब्रह्मजनकाय नमः।</p>
            </li>
            <li>
                <p>ॐ कैटभासुरमर्दनाय नमः।</p>
            </li>
            <li>
                <p>ॐ श्रीधराय नमः।</p>
            </li>
            <li>
                <p>ॐ कामजनकाय नमः।</p>
            </li>
            <li>
                <p>ॐ शेषशायिने नमः।</p>
            </li>
            <li>
                <p>ॐ चतुर्भुजाय नमः।</p>
            </li>
            <li>
                <p>ॐ पाञ्चजन्यधराय नमः।</p>
            </li>
            <li>
                <p>ॐ श्रीमते नमः।</p>
            </li>
            <li>
                <p>ॐ शार्ङ्गपाणये नमः।</p>
            </li>
            <li>
                <p>ॐ जनार्दनाय नमः।</p>
            </li>
            <li>
                <p>ॐ पीताम्बरधराय नमः।</p>
            </li>
            <li>
                <p>ॐ देवाय नमः।</p>
            </li>
            <li>
                <p>ॐ सूर्यचन्द्रविलोचनाय नमः।</p>
            </li>
            <li>
                <p>ॐ मत्स्यरूपाय नमः।</p>
            </li>
            <li>
                <p>ॐ कूर्मतनवे नमः।</p>
            </li>
            <li>
                <p>ॐ क्रोडरूपाय नमः।</p>
            </li>
            <li>
                <p>ॐ नृकेसरिणे नमः।</p>
            </li>
            <li>
                <p>ॐ वामनाय नमः।</p>
            </li>
            <li>
                <p>ॐ भार्गवाय नमः।</p>
            </li>
            <li>
                <p>ॐ रामाय नमः।</p>
            </li>
            <li>
                <p>ॐ बलिने नमः।</p>
            </li>
            <li>
                <p>ॐ कल्किने नमः।</p>
            </li>
            <li>
                <p>ॐ हयाननाय नमः।</p>
            </li>
            <li>
                <p>ॐ विश्वम्भराय नमः।</p>
            </li>
            <li>
                <p>ॐ शिशुमाराय नमः।</p>
            </li>
            <li>
                <p>ॐ श्रीकराय नमः।</p>
            </li>
            <li>
                <p>ॐ कपिलाय नमः।</p>
            </li>
            <li>
                <p>ॐ ध्रुवाय नमः।</p>
            </li>
            <li>
                <p>ॐ दत्तत्रेयाय नमः।</p>
            </li>
            <li>
                <p>ॐ अच्युताय नमः।</p>
            </li>
            <li>
                <p>ॐ अनन्ताय नमः।</p>
            </li>
            <li>
                <p>ॐ मुकुन्दाय नमः।</p>
            </li>
            <li>
                <p>ॐ दधिवामनाय नमः।</p>
            </li>
            <li>
                <p>ॐ धन्वन्तरये नमः।</p>
            </li>
            <li>
                <p>ॐ श्रीनिवासाय नमः।</p>
            </li>
            <li>
                <p>ॐ प्रद्युम्नाय नमः।</p>
            </li>
            <li>
                <p>ॐ पुरुषोत्तमाय नमः।</p>
            </li>
            <li>
                <p>ॐ श्रीवत्सकौस्तुभधराय नमः।</p>
            </li>
            <li>
                <p>ॐ मुरारातये नमः।</p>
            </li>
            <li>
                <p>ॐ अधोक्षजाय नमः।</p>
            </li>
            <li>
                <p>ॐ ऋषभाय नमः।</p>
            </li>
            <li>
                <p>ॐ मोहिनीरूपधारिणे नमः।</p>
            </li>
            <li>
                <p>ॐ सङ्कर्षणाय नमः।</p>
            </li>
            <li>
                <p>ॐ पृथवे नमः।</p>
            </li>
            <li>
                <p>ॐ क्षीराब्धिशायिने नमः।</p>
            </li>
            <li>
                <p>ॐ भूतात्मने नमः।</p>
            </li>
            <li>
                <p>ॐ अनिरुद्धाय नमः।</p>
            </li>
            <li>
                <p>ॐ भक्तवत्सलाय नमः।</p>
            </li>
            <li>
                <p>ॐ नराय नमः।</p>
            </li>
            <li>
                <p>ॐ गजेन्द्रवरदाय नमः।</p>
            </li>
            <li>
                <p>ॐ त्रिधाम्ने नमः।</p>
            </li>
            <li>
                <p>ॐ भूतभावनाय नमः।</p>
            </li>
            <li>
                <p>ॐ श्वेतद्वीपसुवास्तव्याय नमः।</p>
            </li>
            <li>
                <p>ॐ सनकादिमुनिध्येयाय नमः।</p>
            </li>
            <li>
                <p>ॐ भगवते नमः।</p>
            </li>
            <li>
                <p>ॐ शङ्करप्रियाय नमः।</p>
            </li>
            <li>
                <p>ॐ नीलकान्ताय नमः।</p>
            </li>
            <li>
                <p>ॐ धराकान्ताय नमः।</p>
            </li>
            <li>
                <p>ॐ वेदात्मने नमः।</p>
            </li>
            <li>
                <p>ॐ बादरायणाय नमः।</p>
            </li>
            <li>
                <p>ॐ भागीरथीजन्मभूमिपादपद्माय नमः।</p>
            </li>
            <li>
                <p>ॐ सतां प्रभवे नमः।</p>
            </li>
            <li>
                <p>ॐ स्वभुवे नमः।</p>
            </li>
            <li>
                <p>ॐ विभवे नमः।</p>
            </li>
            <li>
                <p>ॐ घनश्यामाय नमः।</p>
            </li>
            <li>
                <p>ॐ जगत्कारणाय नमः।</p>
            </li>
            <li>
                <p>ॐ अव्ययाय नमः।</p>
            </li>
            <li>
                <p>ॐ बुद्धावताराय नमः।</p>
            </li>
            <li>
                <p>ॐ शान्तात्मने नमः।</p>
            </li>
            <li>
                <p>ॐ लीलामानुषविग्रहाय नमः।</p>
            </li>
            <li>
                <p>ॐ दामोदराय नमः।</p>
            </li>
            <li>
                <p>ॐ विराड्रूपाय नमः।</p>
            </li>
            <li>
                <p>ॐ भूतभव्यभवत्प्रभवे नमः।</p>
            </li>
            <li>
                <p>ॐ आदिदेवाय नमः।</p>
            </li>
            <li>
                <p>ॐ देवदेवाय नमः।</p>
            </li>
            <li>
                <p>ॐ प्रह्लादपरिपालकाय नमः।</p>
            </li>
            <li>
                <p>ॐ श्रीमहाविष्णवे नमः।</p>
            </li>
        </ol>
    </div>
    <h2 class="mtitle" style="margin-bottom: 25px;">॥ Iti Shri Vishnu Ashtottarashatanamavalih Sampurna ॥</h2>
</body>

</html>